
<?php
require('WriteHTML.php');
$htmlTable1=
iconv('UTF-8', 'TIS-620', 'สำหรับนิสิตระดับ ปริญญาตรี หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) และมีประสบการณ์ ในวิชาชีพก่อนเข้าสู่การทำงานจริง โดยมีชั่วโมงปฏิบัติงานเป็นเวลา ๑ ภาคเรียน (๑๖ สัปดาห์) นั้น')
;
$htmlTable2=
iconv('UTF-8', 'TIS-620', 'ประกอบการเป็นหน่วยงานที่มีชื่อเสียง มีมาตราการดำเนินงานเป็นที่ยอมรับอย่างกว้างขวาง จึงขอความอนุเคราะห์พิจารณารับนิสิตหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชา ชั้นปีที่ 4 เข้ารับปฏฺิบัติงานสหกิจศึกษา ตั้งแต่วันที่ ๑๓ พฤศจิกายน ๒๕๖๗ ถึงวันที่ ๑ มีนาคม ๒๕๖๘ จำนวน ๒ คน ดังรายชื่อต่อไปนี้')
;
$htmlTable3=
iconv('UTF-8', 'TIS-620', 'ฝึกปฏิบัติงานสหกิจศึกษา รายละเอียดปรากฏตามสิ่งที่ส่งมาด้วย ๑ ส่งคืนไปยัง คณะวิทยาศาสตร์และ นวัตกรรมดิจิทัล มหาวิทยาลัยทักษิณ เพื่อเตรียมความพร้อมของนิสิตก่อนเข้ารับการฝึก ปฏิบัติงานสหกิจต่อไป')
;

$pdf=new PDF_HTML();
$pdf->AddPage();
$pdf->AddFont('THSarabunNew', '', 'THSarabunNew.php');
$pdf->SetFont('THSarabunNew', '', 16);
$top_margin = 15;  // 1.5 ซม. = 15 มม.
$left_margin = 30; // 3 ซม. = 30 มม.
$right_margin = 20; // 2 ซม. = 20 มม.
$bottom_margin = 0; // 0 ซม.
$pdf->SetMargins($left_margin, $top_margin, $right_margin);
// $pdf->SetAutoPageBreak(true, $bottom_margin);

$cellWidth = 80;
$pdf -> SetY(40);
// $pdf->Cell(20);
$pdf->Cell(20, 6.5, iconv('UTF-8', 'TIS-620', 'ที่ อว.12345/2567'), 0, 1, 'L');
$pdf -> SetY(40);
$pdf->Cell(115,50);
$pdf->Cell(0, 6.5, iconv('UTF-8', 'TIS-620', 'มหาวิทยาลัยทักษิณ'), 0, 1, 'L',0);
$pdf->Cell(115);
$pdf->Cell(0, 6.5, iconv('UTF-8', 'TIS-620', '๒๒๒ หมู่ที่ ๒ ตำบลบ้านพร้าว'), 0, 1, 'L');
$pdf->Cell(115);
$pdf->Cell(0, 6.5, iconv('UTF-8', 'TIS-620', 'อำเภอป่าพะยอม '), 0, 1, 'L');
$pdf->Cell(115);
$pdf->Cell(0, 6.5, iconv('UTF-8', 'TIS-620', 'จังหวัดพัทลุง ๙๓๒๑๐'), 0, 1, 'L');
$pdf->Cell(75.5);
$pdf->Cell(0, 8, iconv('UTF-8', 'TIS-620', '5 สิงหาคม 2567'), 0, 1, 'L');


$cellWidth = 80;
$pdf->Cell(0, 9, iconv('UTF-8', 'TIS-620', 'เรื่อง ขอความอนุเคราะห์รับนิสิตเข้าฝึกปฏิบัติสหกิจศึกษา'), 0, 1, 'L');
$pdf->Cell(0, 8, iconv('UTF-8', 'TIS-620', 'เรียน ผู้จัดการโรงเรียนบ้านบางนา'), 0, 1, 'L');
$pdf->Ln(1.12);
$pdf->MultiCell(0, 8, iconv('UTF-8', 'TIS-620', "สิ่งที่ส่งมาด้วย:  1. แบบตอบรับนิสิตฝึกปฏิบัติสหกิจศึกษา จำนวน 1 ฉบับ"));
$pdf->SetX( $pdf->GetX() + 24); // ปรับค่า 5 เพื่อให้ตำแหน่งตรงกัน
$pdf->MultiCell(0, 8, iconv('UTF-8', 'TIS-620', "2. ใบประเมินผลการฝึกงาน จำนวน 1 ฉบับ"));

$cellWidth = 80;
$pdf->SetX($pdf->GetX() + 24); // ย่อหน้า 24 มม. จากขอบซ้าย
 $pdf->Cell(0, 8, iconv('UTF-8', 'TIS-620', "ด้วยคณะวิทยาศาสตร์และนวัตกรรมดิจิทัล มหาวิทยาลัยทักษิณ ได้จัดให้มีรายวิชาสหกิจศึกษา"));
// $cellWidth = 190;
// $pdf->MultiCell(0, 8, iconv('UTF-8', 'TIS-620', "ปริญญาตรี หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) และมีประสบการณ์ในวิชาชีพก่อนเข้าสู่การทำงานจริง โดยมีชั่วโมงปฏิบัติงานเป็นเวลา ๑ ภาคเรียน (๑๖ สัปดาห์) นั้น"), 0, 1);
// $pdf->WriteHTML($htmlTable);
$pdf->Ln(6);
$pdf->Justify($htmlTable1,163,7);

$cellWidth = 80;
$pdf->SetX($pdf->GetX() + 24); // ย่อหน้า 24 มม. จากขอบซ้าย
 $pdf->Cell(0, 8, iconv('UTF-8', 'TIS-620', "ด้วยคณะวิทยาศาสตร์และนวัตกรรมดิจิทัล มหาวิทยาลัยทักษิณ  พิจารณาเห็นว่า ชื่อสถานประ"));
// $cellWidth = 190;
$pdf->Ln(6);
$pdf->Justify($htmlTable2,163,7);

$pdf->SetX( $pdf->GetX() + 24);
$pdf->MultiCell(0, 8, iconv('UTF-8', 'TIS-620', "๑. นางสาวอังคนา เหมาะกิจ         รหัสประจำตัวนิสิต ๖๔๒๐๒๑๑๓๕"));


$cellWidth = 80;
$pdf->Cell(0, 8, iconv('UTF-8', 'TIS-620', "ทั้งนี้ ขอความกรุณาระบุรายละเอียดเกี่ยวกับงานและคุณสมบัติเพิ่มเติมในการปฏิบัติงานตามแบบตอบรับนิสิตเข้า"));
$pdf->Ln(6);
$pdf->Justify($htmlTable3,163,7);


$pdf->Ln(1.12);
$pdf->SetX( $pdf->GetX() + 24);
$pdf->MultiCell(0, 8, iconv('UTF-8', 'TIS-620', "จึงเรียนมาเพื่อโปรดพิจารณาให้ความอนุเคราะห์และจักขอบคุณยิ่ง"));

$pdf->Ln(3);
$pdf->Cell(75.5);
$pdf->Cell(0, 8, iconv('UTF-8', 'TIS-620', 'ขอแสดงความนับถือ'), 0, 1, 'L');


$pdf->Ln(15);
$pdf->Cell(63);
$pdf->Cell(0, 8, iconv('UTF-8', 'TIS-620', '(ผู้ช่วยศาสตราจารย์ ดร.นพมาศ ปักเข็ม)'), 0, 1, 'L');
$pdf->Cell(62);
$pdf->Cell(0, 6, iconv('UTF-8', 'TIS-620', 'คณบดีคณะวิทยาศาสตร์ ปฏิบัติหน้าที่แทน'), 0, 1, 'L');
$pdf->Cell(71);
$pdf->Cell(0, 6, iconv('UTF-8', 'TIS-620', 'อธิการบดีมหาวิทยาลัยทักษิณ'), 0, 1, 'L');


$pdf->Cell(0, 6, iconv('UTF-8', 'TIS-620', 'คณะวิทยาศาสตร์และนวัตกรรมดิจิทัล'), 0, 1, 'L');
$pdf->Cell(0, 6, iconv('UTF-8', 'TIS-620', 'โทร. ๐ ๗๔๖๐ ๙๖๐๐ ต่อ ๒๑๐๘'), 0, 1, 'L');
$pdf->Cell(0, 6, iconv('UTF-8', 'TIS-620', 'โทรสาร. ๐ ๗๔๖๐ ๙๖๐๗'), 0, 1, 'L');
$pdf->Cell(0, 6, iconv('UTF-8', 'TIS-620', 'ไปรษณีย์อิเล็กทรอนิกส์ : jiraporn@tsu.ac.th'), 0, 1, 'L');
$pdf->Output();
?>